/*
คุณเป็นโปรแกรมเมอร์ของห้างสรรพสินค้าแห่งหนึ่ง ทางห้างสรรพสินค้าต้องการโปรแกรมช่วยคำนวณค่าที่จอดรถของลูกค้าที่นำรถเข้ามาจอดให้ห้าง

หน้าที่ของคุณ คือ เขียนโปรแกรมสำหรับคำนวณค่าที่จอดรถของห้างสรรพสินค้าแห่งนี้

โดยทำการรับค่าเวลาที่ลูกค้าจอดรถ (นาที)

และคำนวณค่าที่จอดรถดังนี้

ชม. แรก จอดฟรี

ชม. ถัดไปชม. ละ 10 บาท
 */
import java.util.Scanner;

public class HW3 {
    public static void main(String[] args){
        Scanner kb = new Scanner(System.in);
int H,Mi,Sum;
 Mi = kb.nextInt();
 H = (Mi+59)/60; // +59 เพราะว่าจะดันเลข ไปชั่วโมงถัดไปได้ เช่น 61+59/60 จะได้ 2 ชม ถ้าไม่ทำ 61/60 จะปัดได้ 1 อยู่ดี
 Sum = ((H-1)*10);
 if (H<=1){
     System.out.println(0);
 }else{
     System.out.println(Sum);
 }
        }
    }

